{
  "_name_or_path": "monologg/koelectra-small-v3-discriminator",
  "architectures": [
    "ElectraForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "embedding_size": 128,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 256,
  "id2label": {
    "0": "O",
    "1": "B-PER",
    "10": "I-LOC",
    "11": "B-CVL",
    "12": "I-CVL",
    "13": "B-DAT",
    "14": "I-DAT",
    "15": "B-TIM",
    "16": "I-TIM",
    "17": "B-NUM",
    "18": "I-NUM",
    "19": "B-EVT",
    "2": "I-PER",
    "20": "I-EVT",
    "21": "B-ANM",
    "22": "I-ANM",
    "23": "B-PLT",
    "24": "I-PLT",
    "25": "B-MAT",
    "26": "I-MAT",
    "27": "B-TRM",
    "28": "I-TRM",
    "29": "X",
    "3": "B-FLD",
    "4": "I-FLD",
    "5": "B-AFW",
    "6": "I-AFW",
    "7": "B-ORG",
    "8": "I-ORG",
    "9": "B-LOC"
  },
  "initializer_range": 0.02,
  "intermediate_size": 1024,
  "label2id": {
    "B-AFW": 5,
    "B-ANM": 21,
    "B-CVL": 11,
    "B-DAT": 13,
    "B-EVT": 19,
    "B-FLD": 3,
    "B-LOC": 9,
    "B-MAT": 25,
    "B-NUM": 17,
    "B-ORG": 7,
    "B-PER": 1,
    "B-PLT": 23,
    "B-TIM": 15,
    "B-TRM": 27,
    "I-AFW": 6,
    "I-ANM": 22,
    "I-CVL": 12,
    "I-DAT": 14,
    "I-EVT": 20,
    "I-FLD": 4,
    "I-LOC": 10,
    "I-MAT": 26,
    "I-NUM": 18,
    "I-ORG": 8,
    "I-PER": 2,
    "I-PLT": 24,
    "I-TIM": 16,
    "I-TRM": 28,
    "O": 0,
    "X": 29
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "electra",
  "num_attention_heads": 4,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "summary_activation": "gelu",
  "summary_last_dropout": 0.1,
  "summary_type": "first",
  "summary_use_proj": true,
  "torch_dtype": "float32",
  "transformers_version": "4.16.2",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 35000
}
