{
  "_name_or_path": "monologg/koelectra-base-v3-discriminator",
  "architectures": [
    "ElectraForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "embedding_size": 768,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "X",
    "1": "O",
    "10": "B-POS",
    "11": "I-POS",
    "12": "B-DAT",
    "13": "I-DAT",
    "14": "B-HEC",
    "15": "I-HEC",
    "16": "B-INF",
    "17": "I-INF",
    "18": "B-EVT",
    "19": "I-EVT",
    "2": "B-PER",
    "20": "B-PRI",
    "21": "I-PRI",
    "22": "B-AFW",
    "23": "I-AFW",
    "24": "B-PIV",
    "25": "I-PIV",
    "3": "I-PER",
    "4": "B-ORG",
    "5": "I-ORG",
    "6": "B-NUM",
    "7": "I-NUM",
    "8": "B-LOC",
    "9": "I-LOC"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "B-AFW": 22,
    "B-DAT": 12,
    "B-EVT": 18,
    "B-HEC": 14,
    "B-INF": 16,
    "B-LOC": 8,
    "B-NUM": 6,
    "B-ORG": 4,
    "B-PER": 2,
    "B-PIV": 24,
    "B-POS": 10,
    "B-PRI": 20,
    "I-AFW": 23,
    "I-DAT": 13,
    "I-EVT": 19,
    "I-HEC": 15,
    "I-INF": 17,
    "I-LOC": 9,
    "I-NUM": 7,
    "I-ORG": 5,
    "I-PER": 3,
    "I-PIV": 25,
    "I-POS": 11,
    "I-PRI": 21,
    "O": 1,
    "X": 0
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "electra",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "summary_activation": "gelu",
  "summary_last_dropout": 0.1,
  "summary_type": "first",
  "summary_use_proj": true,
  "torch_dtype": "float32",
  "transformers_version": "4.16.2",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 35000
}
